
<main class="container" property="mainContentOfPage" resource="#wb-main" typeof="WebPageElement">
<h1>Instructions</h1><h2 class="h3">Sur cette page</h2><ul><li><a href="#_Utiliser_le_gabarit">Utiliser le gabarit Word</a></li><li><a href="#_Utiliser_les_styles">Utiliser les styles Word</a></li><li><a href="#_Exemples_de_documents">Exemples de documents Word</a></li><li><a href="#_Utiliser_le_code">Utiliser le code dans des prototypes</a></li></ul><h2 id="_Use_the_Word"><a id="_Utiliser_le_gabarit">Utiliser le gabarit Word</h2><p>Pour en tirer le meilleur parti, utilisez ce gabarit MS Word :</p><p><a href="https://github.com/quidampepin/doc_to_html/raw/main/word_template/template.dotx">T&eacute;l&eacute;charger le gabarit MS Word</a></p><p>Dans votre document Word, allez dans Fichier &gt; Options, et s&eacute;lectionnez Compl&eacute;ments. En bas, allez dans G&eacute;rer, s&eacute;lectionnez Mod&egrave;les, et cliquez sur Aller. Cliquez sur Joindre et s&eacute;lectionnez le mod&egrave;le que vous avez t&eacute;l&eacute;charg&eacute;. Cochez "Mettre &agrave; jour automatiquement les styles du document". Cliquez sur OK.</p><h2 id="_Use_Word_styles"><a id="_Utiliser_les_styles">Utiliser les styles Word</h2><p>Les styles de base (titres, listes &agrave; puces, gras, italique, etc.) fonctionneront sans probl&egrave;me et seront transform&eacute;s en &eacute;l&eacute;ments HTML appropri&eacute;s. Certains styles personnalis&eacute;s ont &eacute;t&eacute; ajout&eacute;s (disponibles dans les styles du ruban).</p><details><summary>Alertes</summary><p>Les alertes ont besoin d'un titre. Appliquez le bon style d'alerte &agrave; l'en-t&ecirc;te (alert-info, alert-warning, alert-danger, etc.), et appliquez "alert-text" au texte de l'alerte.</p></details><details><summary>Boutons</summary><p>Appliquez le bon style de bouton au texte (btn-cta, btn-danger, btn-primaire, etc.). Veillez &agrave; ajouter un lien hypertexte au texte du bouton.</p></details><details><summary>Afficher-masquer</summary><ul><li>Appliquez le style "summary" &agrave; la partie visible de l'&eacute;l&eacute;ment afficher-masquer.</li><li>Utilisez n'importe quel style pour la partie du contenu qui est cach&eacute;e</li><li>Apr&egrave;s la partie cach&eacute;e, ajoutez le mot "end" (sans majuscules, sans gras, rien), et appliquez le style "details" &agrave; ce mot. Cela indiquera au script quand fermer la balise HTML "details".</li></ul></details><details><summary>Liens internes</summary><p>Le script peut g&eacute;rer les liens internes et cr&eacute;er des ancres automatiquement.</p><ul><li>Dans Word, mettez en surbrillance le texte auquel vous souhaitez ajouter un lien hypertexte.</li><li>Ins&eacute;rez un hyperlien.</li><li>Choisissez "Emplacements dans le document".&rdquo;</li><li>S&eacute;lectionnez l'en-t&ecirc;te vers lequel vous voulez que le lien se dirige.</li></ul></details><details><summary>&Eacute;tiquettes</summary><p>Appliquez le bon style d'&eacute;tiquette au texte (label-danger, label-default, label-info, label-primary, etc.).</p></details><details><summary>Navigation multi-pages</summary><ul><li>Avant les items de navigation, ajoutez le mot "start" (pas de majuscules, pas de gras, rien), et appliquez le style "multi-pate-start" &agrave; ce mot.</li><li>Appliquez le style "multi-page-active" &agrave; l'item de navigation de la page sur laquelle vous vous trouvez.</li><li>Appliquez le style "multi-page-item" &agrave; tous les autres items de navigation.</li><li>Apr&egrave;s les &eacute;l&eacute;ments de navigation, ajoutez le mot "end" (pas de majuscules, pas de gras, rien), et appliquez le style "multi-page-end" &agrave; ce mot.</li></ul></details><details><summary>Liste num&eacute;rot&eacute;e</summary><p>Appliquez le style "numbered" aux &eacute;l&eacute;ments de la liste num&eacute;rot&eacute;e.</p></details><details><summary>Navigation de style m&eacute;tro</summary><ul><li>Appliquez le style "subway-group-h1" au nom du groupe de pages (en tant que tout premier &eacute;l&eacute;ment de votre document Word).</li><li>Appliquez le style "subway-nav-active" &agrave; l'item de navigation de la page sur laquelle vous vous trouvez.</li><li>Appliquez le style "subway-nav" &agrave; tous les autres items de navigation.</li><li>Appliquez le style "subway-section-h1" &agrave; la section H1 de la page sur laquelle vous vous trouvez (juste apr&egrave;s la liste des items de navigation).</li></ul></details><h2 id="_Sample_Word_documents"><a id="_Exemples_de_documents">Exemples de documents Word</h2><p><a id="_Use_code_in"><a id="_Utiliser_le_code">T&eacute;l&eacute;chargez ces documents Word pour voir comment certaines mises en forme sont effectu&eacute;es et pour tester l'outil.</p><ul><li><a href="https://github.com/quidampepin/doc_to_html/raw/main/sample_docs/simple_formatting.docx">Mise en forme de base</a></li><li><a href="https://github.com/quidampepin/doc_to_html/raw/main/sample_docs/subway_nav.docx">Navigation de style m&eacute;tro</a></li><li><a href="https://github.com/quidampepin/doc_to_html/raw/main/sample_docs/ineternal_links.docx">Liens internes (ancrage automatique)</a></li><li><a href="https://github.com/quidampepin/doc_to_html/raw/main/sample_docs/multi_page_nav.docx">Navigation multi-pages</a></li></ul><h2>Utiliser le code dans des prototypes</h2><p>Le script g&eacute;n&egrave;re 2 extraits de code : le code pour la page compl&egrave;te (que vous pouvez copier dans GitHub, par exemple), et le code pour la section principale (que vous pouvez copier dans AEM, par exemple). </p><h3>Code pour la page compl&egrave;te</h3><ul><li>Ouvrez la section affichable "Code pour la page compl&egrave;te"</li><li>Cliquez sur &ldquo;Copier le code dans le presse-papiers &rdquo;</li><li>Si vous voulez que le code soit format&eacute; correctement, allez dans un formateur HTML (par exemple, https://www.freeformatter.com/html-formatter.html) et collez le code.</li><li>Collez le code l&agrave; o&ugrave; vous en avez besoin (par exemple, dans une section GitHub pour votre organisation).</li></ul><h3>Code pour AEM</h3><ul><li>Ouvrez la section affichable "Code pour AEM"</li><li>Cliquez sur &ldquo;Copier le code dans le presse-papiers &rdquo;</li><li>Si vous voulez que le code soit format&eacute; correctement, allez dans un formateur HTML (par exemple, https://www.freeformatter.com/html-formatter.html) et collez le code.</li><li>Dans AEM, utilisez in composant HTML</li><li>Collez le code</li><li>Vous devrez peut-&ecirc;tre supprimer la balise "main" et la balise "h1" (et la balise "main" de fermeture), &agrave; moins que vous ne supprimiez le H1 qui vient automatiquement dans AEM</li></ul>

